app/controllers/documents_controller.rb

  def create
    nameFile = params["fileName"].to_s
    if nameFile.blank?
      render js: "alertify.notify('No se puede subir un archivo sin nombre', 'warning', 3, function () {});"
    else
      numAccount = current_account
      @document = Document.new
      @document.account = numAccount
      file = params["file"]
      @document.fileName = nameFile
      if @document.correct_file nameFile, file
        if @document.save!
---
INSERT INTO `documents` (`fileName`, `account_id`, `created_at`, `updated_at`) VALUES ('Creditos', 11, '2018-12-16 14:32:49', '2018-12-16 14:32:49')

  def show
    session[:conversations] ||= []

    @accounts = Account.all.where.not(id: current_account)
    @conversations = Conversation.includes(:recipient, :messages)
                         .find(session[:conversations])

    @document = Document.find(params[:id])
---
SELECT  `documents`.* FROM `documents` WHERE `documents`.`id` = 1 LIMIT 1

  def saveDocument
    if params[:fileName] != '' && params[:documentContent] != ''
      numAccount = current_account
      html = params[:documentContent]
      html = '<html><head></head><body>'+ html + '</body></html>'
      file = Htmltoword::Document.create_and_save html, Rails.root.join('public','archivo.docx')
---
INSERT INTO `documents` (`fileName`, `account_id`, `created_at`, `updated_at`) VALUES ('nuevo.docx', 11, '2018-12-15 22:02:59', '2018-12-15 22:02:59')