app/controllers/shared_documents_controller.rb

  def new
    session[:conversations] ||= []

    @accounts = Account.all.where.not(id: current_account)
    @conversations = Conversation.includes(:recipient, :messages)
                         .find(session[:conversations])

    accountIDShared = SharedDocument.new.getAccountsIDSharedWithThisDocument(params[:id])
    @document = Document.find(params[:id])
    @accountsBag = []
    accounts = Account.new.getAccounts(current_account)
    accounts.each do |account|
      if !accountIDShared.include?(account.id)
---
SELECT  `documents`.* FROM `documents` WHERE `documents`.`id` = 4 LIMIT 1
SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 11 ORDER BY `accounts`.`id` ASC LIMIT 1
SELECT  `shared_documents`.* FROM `shared_documents` WHERE `shared_documents`.`document_id` = '4'